       01 DFHBMSCA.
          05 DFHBMPEM       PIC X VALUE IS '&'.
          05 DFHBMPNL       PIC X VALUE IS '%'.
          05 DFHBMPFF       PIC X VALUE IS '$'.
          05 DFHBMPCR       PIC X VALUE IS '/'.
